from telethon import events
import random, re
from uniborg.util import admin_cmd

RUNSREACTS = [
    "`നമ്മൾ നമ്മൾ പോലുമറിയാതെ അധോലോകം ആയി മാറിക്കഴിഞ്ഞിരിക്കുന്നു ഷാജിയേട്ടാ...😐 `",
    "`നാലാമത്തെ പെഗ്ഗിൽ ഐസ്ക്യൂബ്സ് വീഴുന്നതിനു മുൻപ് ഞാൻ അവിടെ എത്തും.....😉 `",
    "`പോരുന്നോ എന്റെ കൂടെ!😜 `",
    "`ഡാ ദാസാ... ഏതാ ഈ അലവലാതി.....😒 `",
    "`കാർ എൻജിൻ ഔട്ട് കംപ്ലീറ്റ്ലി.....🥵 `",
    "`അല്ല ഇതാര് വാര്യംപിള്ളിയിലെ മീനാക്ഷി അല്ലയോ... എന്താ മോളെ സ്കൂട്ടറില്....🙈 `",
    "`മോന്തയ്ക്കിട്ട് കൊടുത്തിട്ട് ഒന്ന് എടുത്ത് കാണിച്ചുകൊടുക്ക് അപ്പോൾ കാണും ISI മാർക്ക് 😑 `",
    "`ഇട്ടിട്ട് പോകില്ലെന്ന് ഉറപ്പുള്ള പെണ്ണ്  🤰🤱👩👦 ”`",
    "`ദൈവമേ എന്നെ മാത്രം രക്ഷിക്കണേ....⛪ `",
    "`ഇത് കണ്ണോ അതോ കാന്തമോ...👀 `",
]

@borg.on(admin_cmd(pattern="qk"))
async def _(event):
    if event.fwd_from:
         return
    bro = random.randint(0, len(RUNSREACTS) - 1)    
    reply_text = RUNSREACTS[bro]
    await event.edit(reply_text)
